frank26080115/robots/Roach/libraries/Esp32RcRadio/Esp32RcRadio.cpp
#include "Esp32RcRadio.h"

#include <esp_wifi.h>
#include <esp_wifi_types.h>
#include <esp_system.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

typedef struct
{
    // 802.11 packet structure
    uint16_t frame_ctrl;
    uint16_t duration;   // note: this field might be changed by API, do not check it or checksum it
    uint32_t addrs[3];   // MAC addresses for RX and TX, 6 bytes each, but since we are using 32 bit integers, we can stuff 3 items in here
                         // the 1st item is just random for each packet
                         // the 2nd item is the UID of the pairing, but XOR'ed with the random number
                         // the 3rd item is the session ID, but XOR'ed with the random number
    uint8_t  padding[2]; // some frame types use these field for things
    uint8_t  chan_hint;  // what channel index was actually used to TX
    uint32_t seq_num;
    uint8_t  flags;      // contains things like a reply-request
    #ifdef E32RCRAD_ADAPTIVE_INTERVAL
    uint8_t  interval;   // transmission interval that the receiver can adapt the timeout
    #endif
    uint8_t  payload[E32RCRAD_PAYLOAD_SIZE]; // our custom payload
    uint32_t chksum;     // userspace checksum over the payload, accounts for the salt, not to be confused with FCS
                         // combined with the salt, this is meant to prevent impersonation attacks
}
__attribute__ ((packed))
e32rcrad_pkt_t;

#define E32RCRAD_FRAME_CONTROL_ACTION 0x00D0
#define E32RCRAD_FRAME_CONTROL_PROBE  0x0040
#define E32RCRAD_FRAME_CONTROL_BA     0x0094 // not allowed
#define E32RCRAD_FRAME_CONTROL        E32RCRAD_FRAME_CONTROL_ACTION

static uint8_t tx_buffer[E32RCRAD_PAYLOAD_SIZE];     // application buffer
static uint8_t rx_buffer[E32RCRAD_PAYLOAD_SIZE];     // application buffer
static uint8_t frame_buffer[sizeof(e32rcrad_pkt_t)]; // the buffer that's actually sent (and also used for rx comparisons)
static bool    rx_flag;                              // indicator of new packet received

static char    txt_rx_buffer[E32RCRAD_PAYLOAD_SIZE]; // application text buffer
static char    txt_tx_buffer[E32RCRAD_PAYLOAD_SIZE]; // application text buffer
static bool    txt_flag;                             // indicator of text packet received

static uint32_t invalid_sessions[E32RCRAD_REM_USED_SESSIONS];

static bool has_wifi_init = false; // only init once

static Esp32RcRadio* instance; // only one instance allowed for the callback

static void promiscuous_handler(void* buf, wifi_promiscuous_pkt_type_t type);
extern uint32_t e32rcrad_getCheckSum(uint32_t salt, uint8_t* data, uint8_t len);

Esp32RcRadio::Esp32RcRadio(bool is_tx)
{
    _is_tx = is_tx;
    memset(invalid_sessions, 0, sizeof(uint32_t) * E32RCRAD_REM_USED_SESSIONS);
    var_reset();
}

void Esp32RcRadio::var_reset(void)
{
    _tx_interval = E32RCRAD_TX_INTERV_DEF;
    _session_id = 0;
    _seq_num = 0;
    _seq_num_prev = 0;
    _statemachine = 0;
    _stat_tmr = 0;
    _stat_tx_cnt = 0;
    _stat_rx_cnt = 0;
    _stat_txt_cnt = 0;
    _stat_drate = 0;
    _stat_rx_lost = 0;
    _stat_loss_rate = 0;
    #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
    memset(_stat_rx_errs, 0, 4*12);
    #endif
    _stat_rx_total = 0;
    _stat_rx_good = 0;
    _last_rx_time = 0;
    _last_tx_time = 0;
    _last_hop_time = 0;
    _last_rx_time_4hop = 0;
    _sync_hop_cnt = 0;
    _tx_replyreq_tmr = 0;
    _reply_request_rate = 1000;
    _reply_request_latch = false;
    _cur_chan = 0;
    _last_chan = -1;
    _text_send_timer = 0;
    _stat_rx_spent_time = 0;
    rx_flag = false;
    txt_flag = false;
}

void Esp32RcRadio::begin(uint16_t chan_map, uint32_t uid, uint32_t salt)
{
    instance = (Esp32RcRadio*)this;

    #ifdef E32RCRAD_DEBUG_PINS
    pinMode     (E32RCRAD_DEBUG_PIN_TX, OUTPUT);
    digitalWrite(E32RCRAD_DEBUG_PIN_TX, _dbgpin_tx = LOW);
    pinMode     (E32RCRAD_DEBUG_PIN_RX, OUTPUT);
    digitalWrite(E32RCRAD_DEBUG_PIN_RX, _dbgpin_rx = LOW);
    pinMode     (E32RCRAD_DEBUG_PIN_CH, OUTPUT);
    digitalWrite(E32RCRAD_DEBUG_PIN_CH, _dbgpin_ch = LOW);
    #endif

    var_reset();
    _uid = uid;
    _salt = salt;

    set_chan_map(chan_map);

    if (has_wifi_init == false) // only start once
    {
        has_wifi_init = true;
        //esp_netif_init();
        //esp_event_loop_create_default();
        //esp_netif_create_default_wifi_ap();
        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        esp_wifi_init(&cfg);
        esp_wifi_set_mode(WIFI_MODE_AP);
        wifi_config_t ap_config = {
            .ap = {
                .ssid = {0},
                .password = {0},
                .ssid_len = 0,
                .channel = _hop_table[_cur_chan % _hop_tbl_len],
                .authmode = WIFI_AUTH_WPA2_PSK,
                .ssid_hidden = 1,
                .max_connection = 4,
                .beacon_interval = 60000
            }
        };

        esp_wifi_set_config(WIFI_IF_AP, &ap_config);
        #ifdef E32RCRAD_FORCE_PHY_RATE
        esp_wifi_config_80211_tx_rate(WIFI_IF_AP, WIFI_PHY_RATE_54M); // sets PHY rate
        #endif
        #ifdef E32RCRAD_FORCE_BANDWIDTH
        esp_wifi_set_bandwidth(WIFI_IF_AP, WIFI_BW_HT20);
        #endif
        esp_wifi_start();
        esp_wifi_set_ps(WIFI_PS_NONE);
        #ifdef E32RCRAD_FORCE_RFPOWER
        esp_wifi_set_max_tx_power(84);
        #endif
        prep_listener();
    }
    else
    {
        next_chan();
    }

    if (_is_tx == false)
    {
        start_listener();
    }
    else
    {
        while (_session_id == 0) {
            _session_id = esp_random(); // this needs to happen after wifi init to get the real randomness from RF
        }
        srand(_session_id);
    }
}

void Esp32RcRadio::gen_hop_table(void)
{
    // generate hop table, fill table with an entry if the bit of the map bitmask is set
    int i, j;
    for (i = 0, j = 0; i < 14; i++)
    {
        if ((_chan_map & (1 << i)) != 0) {
            _hop_table[j] = i + 1;
            _hop_table[j + 1] = 0;
            j++;
            _hop_tbl_len = j;
        }
    }

