frank26080115/robots/Roach/libraries/Esp32RcRadio/Esp32RcRadio.cpp
    if (_salt != 0)
    {
        uint32_t tmp32[4];
        tmp32[0] = _uid;
        tmp32[1] = _salt;
        tmp32[2] = e32rcrad_getCheckSum(0, (uint8_t*)tmp32, 8);
        tmp32[3] = e32rcrad_getCheckSum(0, (uint8_t*)&(tmp32[1]), 8);
        uint8_t* tmp8 = (uint8_t*)tmp32;

        // shuffle the table according to our salt
        // this prevents jamming by following a known hop sequence
        for (i = 0; i < _hop_tbl_len; i++)
        {
            j = tmp8[i] % _hop_tbl_len;
            uint8_t t = _hop_table[j];
            _hop_table[j] = _hop_table[i];
            _hop_table[i] = t;
        }
    }
    #ifdef E32RCRAD_DEBUG_HOPTABLE
    Serial.printf("Hop Table: ");
    for (i = 0; i < _hop_tbl_len; i++) {
        Serial.printf("%d  ", _hop_table[i]);
    }
    #endif
    _cur_chan %= _hop_tbl_len;
}

void Esp32RcRadio::set_chan_map(uint16_t x)
{
    _chan_map = x & 0x3FFF;
    _chan_map = _chan_map == 0 ? E32RCRAD_CHAN_MAP_DEFAULT : _chan_map;
    gen_hop_table();
}

void Esp32RcRadio::set_tx_interval(uint16_t x)
{
    _tx_interval = x > E32RCRAD_TX_INTERV_MAX ? E32RCRAD_TX_INTERV_MAX : (x < E32RCRAD_TX_INTERV_MIN ? E32RCRAD_TX_INTERV_MIN : x);
}

void Esp32RcRadio::send(uint8_t* data, bool immediate)
{
    memcpy(tx_buffer, data, E32RCRAD_PAYLOAD_SIZE);

    if (immediate) {
        tx();
    }
}

void Esp32RcRadio::tx(void)
{
    bool is_text = _text_send_timer > 0;

    e32rcrad_pkt_t* ptr = (e32rcrad_pkt_t*)frame_buffer;
    gen_header();
    if (is_text) {
        ptr->flags ^= (1 << E32RCRAD_FLAG_TEXT);
    }

    uint8_t* src_buf = is_text ? (uint8_t*)txt_tx_buffer : (uint8_t*)tx_buffer;

    #ifdef E32RCRAD_FINGER_QUOTES_ENCRYPTION
    // copy while "encrypting"
    uint32_t r = ptr->addrs[0];
    int j;
    for (j = 0; j < E32RCRAD_PAYLOAD_SIZE; j += 4)
    {
        uint32_t* ptr_src = (uint32_t*)&(src_buf[j]);
        uint32_t* ptr_dst = (uint32_t*)&(ptr->payload[j]);
        *ptr_dst = (*ptr_src) ^ r;
    }
    #else
    memcpy(ptr->payload, src_buf, E32RCRAD_PAYLOAD_SIZE);
    #endif

    ptr->chksum = e32rcrad_getCheckSum(_salt, &(frame_buffer[4]), sizeof(e32rcrad_pkt_t) - 8);

    #ifdef E32RCRAD_DEBUG_PINS
    digitalWrite(E32RCRAD_DEBUG_PIN_TX, _dbgpin_tx = (_dbgpin_tx == LOW ? HIGH : LOW));
    #endif

    int i;
    for (i = 0; i == 0 || (i < E32RCRAD_TX_RETRANS && _is_tx && is_text == false); i++)
    {
        uint32_t tx_len = sizeof(e32rcrad_pkt_t);
        tx_len += rand() % 8; // randomize length to prevent analysis
        esp_wifi_80211_tx(WIFI_IF_AP, frame_buffer, tx_len, false);
        //free80211_send(frame_buffer, tx_len);
    }

    #ifdef E32RCRAD_DEBUG_TX
    Serial.printf("TX[t %u][c %u][s %u]: ", millis(), hop_table[_cur_chan], sizeof(e32rcrad_pkt_t));
    int i;
    for (i = 0; i < sizeof(e32rcrad_pkt_t); i++)
    {
        Serial.printf("0x%02X ", frame_buffer[i]);
    }
    Serial.printf("\r\n");
    #endif

    _stat_tx_cnt++;
    _last_tx_time = millis();

    #ifdef E32RCRAD_DEBUG_HOP
    Serial.printf("TX %u %u\r\n", _last_tx_time, _seq_num);
    #endif

    _statemachine = E32RCRAD_SM_SENDING;

    if (is_text)
    {
        // text needs to be repeatedly sent for redundancy but we also want to avoid duplicates
        // so we do not increment sequence number, unless we have finished sending the text
        _text_send_timer--;
        if (_text_send_timer <= 0) {
            _seq_num++;
        }
    }
    else
    {
        // increment sequence number since it's not text, we want to avoid duplicates
        _seq_num++;
    }

    if (_seq_num == 0) {
        // roll-over occured, start new session
        _session_id = esp_random();
        _seq_num++;
    }
}

void Esp32RcRadio::next_chan(void)
{
    _cur_chan++;
    _cur_chan %= _hop_tbl_len;
    uint8_t nchan = _hop_table[_cur_chan];
    //if (nchan != _last_chan) // prevent wasting time changing to the same channel
    {
        #ifdef E32RCRAD_DEBUG_HOP
        Serial.printf("HOP %u %u %u\r\n", millis(), _cur_chan, nchan);
        #endif

        if (_is_tx == false) {
            esp_wifi_set_promiscuous(false);
        }

        // I'm like 99% sure we don't need to actually retry these calls
        int retries;
        for (retries = 100; retries > 0; retries--)
        {
            if (esp_wifi_set_channel(nchan, WIFI_SECOND_CHAN_NONE) == ESP_OK)
            {
                uint8_t x;
                wifi_second_chan_t x2;
                if (esp_wifi_get_channel(&x, &x2) == ESP_OK) {
                    if (x == nchan) {
                        break;
                    }
                }
            }
        }

        #ifdef E32RCRAD_DEBUG_PINS
        digitalWrite(E32RCRAD_DEBUG_PIN_CH, _dbgpin_ch = (_dbgpin_ch == LOW ? HIGH : LOW));
        #endif

        if (_is_tx == false) {
            start_listener();
        }
        _last_chan = nchan;
    }

    _last_hop_time = millis();
}

void Esp32RcRadio::gen_header(void)
{
    uint32_t now = millis();

    e32rcrad_pkt_t* ptr = (e32rcrad_pkt_t*)frame_buffer;
    ptr->frame_ctrl = E32RCRAD_FRAME_CONTROL;
    ptr->duration = 0;

    uint32_t r =
        #ifdef E32RCRAD_FINGER_QUOTES_RANDOMNESS
            rand()
        #else
            0
        #endif
        ;
    // the random number is used to make the MAC addresses random each time just in case it's a match for a real device
    // we don't want that device to actually be confused
    // it also makes the packet look like it's encrypted
    // it is not...
    // if the attacker reads this source code, the random number is pretty much useless
    ptr->padding[0] = r;
    ptr->padding[1] = ~r;
    ptr->addrs[0]   = r;
    ptr->addrs[1]   = _uid         ^ r;
    ptr->addrs[2]   = _session_id  ^ r;
    ptr->chan_hint  = _cur_chan    ^ r;
    ptr->seq_num    = _seq_num     ^ r;
    #ifdef E32RCRAD_ADAPTIVE_INTERVAL
    ptr->interval   = _tx_interval ^ r;
    #endif
    ptr->flags      = 0;

    #ifdef E32RCRAD_BIDIRECTIONAL
    if (_is_tx == false)
    {
        ptr->flags |= (1 << E32RCRAD_FLAG_REPLY);
    }
    else
    {
        if ((now - _tx_replyreq_tmr) >= _reply_request_rate && _reply_request_rate != 0) {
            _reply_request_latch = true;
            _tx_replyreq_tmr = now;
        }
        if (_reply_request_latch) {
            ptr->flags |= (1 << E32RCRAD_FLAG_REPLYREQUEST);
        }
    }
    #endif

