frank26080115/robots/Roach/libraries/Esp32RcRadio/Esp32RcRadio.cpp
    ptr->flags ^= r;
}

void Esp32RcRadio::task(void)
{
    uint32_t now = millis();

    if (_is_tx == false)
    {
        if (_statemachine == E32RCRAD_SM_SENDING)
        {
            if ((now - _last_tx_time) >= E32RCRAD_TX_MIN_TIME)
            {
                _statemachine = E32RCRAD_SM_LISTENING;
            }
        }
        else if (_statemachine == E32RCRAD_SM_REPLYING)
        {
            //esp_wifi_set_promiscuous(false);
            if ((now - _last_rx_time) >= E32RCRAD_TX_MIN_TIME)
            {
                tx();
                // state will be set to sending
            }
        }
        else if (_statemachine == E32RCRAD_SM_LISTENING && (now - _last_rx_time_4hop) >= _tx_interval) // reply has been sent, can switch channels
        {
            _last_rx_time_4hop = now;
            next_chan(); // this should also restart the listening
            _statemachine = E32RCRAD_SM_IDLE;
        }
        else if (_sync_hop_cnt > 0 && (now - _last_rx_time_4hop) >= _tx_interval)
        {
            // we do quick hops in attempts to quickly resynchronize with the transmitter
            _last_rx_time_4hop = now;
            _sync_hop_cnt--;
            next_chan();
        }
        else if (_sync_hop_cnt <= 0 && (now - _last_hop_time) >= (_tx_interval <= 0 ? 100 : (_tx_interval * 3)))
        {
            // quick hops didn't work, so we've lost sync with transmitter, do slow hops now
            // this is so that we don't stay in a useless channel forever
            next_chan();
        }

        // prevent statistics overflow
        if (_stat_rx_total > 1000 || _stat_rx_good > 1000) {
            _stat_rx_total /= 2;
            _stat_rx_good  /= 2;
        }
    }
    else // _is_tx == true
    {
        if (_statemachine == E32RCRAD_SM_SENDING)
        {
            #ifdef E32RCRAD_BIDIRECTIONAL
            if ((now - _last_tx_time) >= E32RCRAD_TX_MIN_TIME)
            {
                start_listener(); // start listening for a reply
                _statemachine = E32RCRAD_SM_LISTENING;
            }
            #else
            _statemachine = E32RCRAD_SM_LISTENING;
            #endif
        }
        else if (_statemachine == E32RCRAD_SM_LISTENING)
        {
            if ((now - _last_tx_time) >= (_tx_interval / 3))
            {
                _statemachine = E32RCRAD_SM_IDLE;
                #ifdef E32RCRAD_BIDIRECTIONAL
                esp_wifi_set_promiscuous(false);
                #endif
                next_chan();
            }
        }
        else
        {
            if ((now - _last_tx_time) >= _tx_interval)
            {
                // send queued packet if enough time has passed
                tx();
                // _last_time will be set from inside
            }
        }
    }

    if ((now - _stat_tmr) >= 1000)
    {
        _stat_drate = _is_tx ? _stat_tx_cnt : _stat_rx_cnt;
        _stat_loss_rate = _stat_rx_lost;
        _stat_tx_cnt = 0;
        _stat_rx_cnt = 0;
        _stat_rx_lost = 0;
        _stat_tmr = now;
    }
}

void Esp32RcRadio::start_listener(void)
{
    //prep_listener();
    esp_wifi_set_promiscuous(true);
}

void Esp32RcRadio::prep_listener(void)
{
    wifi_promiscuous_filter_t filter1 = {
        .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT
    };
    //wifi_promiscuous_filter_t filter2 = {
    //    .filter_mask = WIFI_PROMIS_FILTER_MASK_CTRL | WIFI_PROMIS_CTRL_FILTER_MASK_BA
    //};
    esp_wifi_set_promiscuous_filter(&filter1);
    //esp_wifi_set_promiscuous_ctrl_filter(&filter2);
    esp_wifi_set_promiscuous_rx_cb(&promiscuous_handler);
}

static void promiscuous_handler(void* buf, wifi_promiscuous_pkt_type_t type)
{
    #ifdef E32RCRAD_COUNT_RX_SPENT_TIME
    volatile uint32_t t_start = micros();
    #endif
    instance->handle_rx(buf, type);
    #ifdef E32RCRAD_COUNT_RX_SPENT_TIME
    volatile uint32_t t_end = micros();
    instance->add_rx_spent_time(t_end - t_start);
    #endif
}

void Esp32RcRadio::handle_rx(void* buf, wifi_promiscuous_pkt_type_t type)
{
    uint32_t now = millis();

    _stat_rx_total++;
    wifi_promiscuous_pkt_t* pkt = (wifi_promiscuous_pkt_t*)buf;
    wifi_pkt_rx_ctrl_t ctrl = (wifi_pkt_rx_ctrl_t)pkt->rx_ctrl;

    uint8_t* u8_ptr = (uint8_t*)pkt->payload;
    e32rcrad_pkt_t* parsed = (e32rcrad_pkt_t*)u8_ptr;

    #ifdef E32RCRAD_DEBUG_RX
    if (parsed->frame_ctrl == E32RCRAD_FRAME_CONTROL)
    {
        Serial.printf("RX[t %u]: ", millis());
        int i;
        for (i = 0; i < ctrl.sig_len; i++)
        {
            Serial.printf("0x%02X ", u8_ptr[i]);
        }
        Serial.printf("\r\n");
    }
    #endif

    if (ctrl.sig_len < sizeof(e32rcrad_pkt_t)) {
        #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
        _stat_rx_errs[0]++;
        #endif
        return;
    }

    uint32_t* hdr = (uint32_t*)u8_ptr;
    uint32_t r = 
        #ifdef E32RCRAD_FINGER_QUOTES_RANDOMNESS
            hdr[1] // extract the meaningless random number to use to recover other data fields
        #else
            0
        #endif
        ;
    uint32_t rx_uid   = hdr[2] ^ r;
    uint32_t rx_sess  = hdr[3] ^ r;
    uint8_t  rx_flags = parsed->flags ^ r;
    uint32_t rx_seq   = parsed->seq_num ^ r;

    if (parsed->frame_ctrl != E32RCRAD_FRAME_CONTROL) { // frame type must match
        #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
        _stat_rx_errs[1]++;
        //Serial.printf("E HDR 0x%04X\n", parsed->frame_ctrl);
        #endif
        return;
    }
    if (rx_uid != _uid) { // UID must match
        #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
        _stat_rx_errs[2]++;
        #endif
        return;
    }
    if (rx_sess == 0) { // invalid session ID
        #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
        _stat_rx_errs[3]++;
        #endif
        return;
    }

    // verify checksum of payload against claimed checksum
    uint32_t chksum = e32rcrad_getCheckSum(_salt, (uint8_t*)&(u8_ptr[4]), sizeof(e32rcrad_pkt_t) - 8);
    if (parsed->chksum != chksum) {
        #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
        _stat_rx_errs[4]++;
        #endif
        return;
    }
    // checksum needs to be valid for the next few security features to work and not be overwhelmed

    bool to_hop = false;

    if (_is_tx == false) // only receiver requires additional security
    {
        to_hop = true; // receiver should hop immediately if no need to reply

        if (_session_id == 0) // first packet ever received
        {
            // start the new session
            _session_id = rx_sess;
            _seq_num_prev = rx_seq;
        }
        else if (_session_id == rx_sess)
        {
            if (rx_seq <= _seq_num_prev)
            {
                // ignore duplicate or replay-attack
                // still do a channel hop if it's a text
                if ((rx_flags & (1 << E32RCRAD_FLAG_TEXT)) != 0) {
                    _cur_chan = parsed->chan_hint ^ r; // sync with channel hop
                    next_chan();
                    _last_rx_time = now;
                }
                #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
                _stat_rx_errs[5]++;
                #endif
                return;
            }

            // calculate how many packets were lost
            uint32_t diff = rx_seq - _seq_num_prev;
            diff -= 1;
            diff = diff > 0xFFFF ? 0xFFFF : diff;
            _stat_rx_lost += diff;

            _seq_num_prev = rx_seq;
        }
        else if (_session_id != rx_sess)
        {
            int i;
            // check if session ID is still valid
            for (i = 0; i < E32RCRAD_REM_USED_SESSIONS; i++)
            {
                uint32_t j = invalid_sessions[i];
                if (j == rx_sess) { // is invalid
                    #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
                    _stat_rx_errs[6]++;
                    #endif
                    return;
                }
                else if (j == 0) {
                    break;
                }
            }
            // store old session as invalid
            if (invalid_sessions[E32RCRAD_REM_USED_SESSIONS - 1] == 0) // enough space
            {
                // store in next empty slot
                for (i = 0; i < E32RCRAD_REM_USED_SESSIONS; i++)
                {
                    uint32_t j = invalid_sessions[i];
                    if (j == 0) {
                        invalid_sessions[i] = _session_id;
                    }
                }
            }
            else
            {
                // store in any slot
                invalid_sessions[rand() % E32RCRAD_REM_USED_SESSIONS] = _session_id;
            }
            // start new session
            _session_id = rx_sess;
            _seq_num_prev = rx_seq;
        }

        #ifdef E32RCRAD_ADAPTIVE_INTERVAL
        _tx_interval = parsed->interval ^ r;
        #endif

