frank26080115/robots/Roach/libraries/Esp32RcRadio/Esp32RcRadio.cpp
        #ifdef E32RCRAD_BIDIRECTIONAL
        if ((rx_flags & (1 << E32RCRAD_FLAG_REPLYREQUEST)) != 0 || _text_send_timer > 0) {
            _statemachine = E32RCRAD_SM_REPLYING; // signal that the tx function needs to run
            to_hop = false; // receiver should hop immediately if no need to reply, but wait to hop if need to reply
        }
        else
        #endif
        {
            _statemachine = E32RCRAD_SM_IDLE;
        }
    }
    #ifdef E32RCRAD_BIDIRECTIONAL
    else // _is_tx == true
    {
        // a reply isn't critical, but make sure the session ID is correct
        if (_session_id != rx_sess) {
            #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
            _stat_rx_errs[7]++;
            #endif
            return;
        }

        if (rx_seq <= _seq_num_prev)
        {
            // ignore duplicate or replay-attack
            #ifdef E32RCRAD_DEBUG_RX_ERRSTATS
            _stat_rx_errs[8]++;
            #endif
            return;
        }
        _seq_num_prev = rx_seq;
    }
    #endif

    // all checks pass

    #ifdef E32RCRAD_DEBUG_PINS
    digitalWrite(E32RCRAD_DEBUG_PIN_RX, _dbgpin_rx = (_dbgpin_rx == LOW ? HIGH : LOW));
    #endif

    uint8_t* dst_buf = ((rx_flags & (1 << E32RCRAD_FLAG_TEXT)) != 0) ? (uint8_t*)txt_rx_buffer : (uint8_t*)rx_buffer;

    #ifdef E32RCRAD_FINGER_QUOTES_ENCRYPTION
    // copy while "decrypting"
    int j;
    for (j = 0; j < E32RCRAD_PAYLOAD_SIZE; j += 4)
    {
        uint32_t* ptr_dst = (uint32_t*)&(dst_buf[j]);
        uint32_t* ptr_src = (uint32_t*)&(parsed->payload[j]);
        *ptr_dst = (*ptr_src) ^ r;
    }
    #else
    memcpy(dst_buf, (void*)parsed->payload, E32RCRAD_PAYLOAD_SIZE);
    #endif

    if ((rx_flags & (1 << E32RCRAD_FLAG_TEXT)) == 0) {
        rx_flag = true;
    }
    else {
        txt_flag = true;
        _stat_txt_cnt++;
    }
    _reply_request_latch = false;

    #ifdef E32RCRAD_DEBUG_HOP
    bool hop_dbg_nl = true;
    Serial.printf("RX %u %u", now, _seq_num_prev);
    #endif

    if (_is_tx == false)
    {
        _cur_chan = parsed->chan_hint ^ r; // sync with channel hop
        #ifdef E32RCRAD_DEBUG_HOP
        Serial.printf(" %u", _cur_chan);
        #endif
        if (to_hop) {
            #ifdef E32RCRAD_DEBUG_HOP
            Serial.printf("\r\nR");
            hop_dbg_nl = false;
            #endif
            next_chan();
            _last_rx_time_4hop = now - (_tx_interval / 8); // offset the time of the next hop very slightly
        }
        else {
            _last_rx_time_4hop = now - _tx_interval + (_tx_interval / 4); // offset the time of the next hop
        }

        // do this many quick hops if the transmitter disappears
        _sync_hop_cnt = _hop_tbl_len * 3;
    }

    #ifdef E32RCRAD_DEBUG_HOP
    if (hop_dbg_nl) {
        Serial.printf("\r\n");
    }
    #endif

    _last_rx_time = now;
    _stat_rx_rssi = ctrl.rssi;
    _stat_rx_good++;
    _stat_rx_cnt++;
}

void Esp32RcRadio::get_rx_stats(uint32_t* total, uint32_t* good, signed* rssi)
{
    if (total != NULL) {
        *total = _stat_rx_total;
    }
    if (good != NULL) {
        *good = _stat_rx_good;
    }
    if (rssi != NULL) {
        *rssi = _stat_rx_rssi;
    }
}

int Esp32RcRadio::available(void)
{
    task();
    return rx_flag ? E32RCRAD_PAYLOAD_SIZE : 0;
}

int Esp32RcRadio::read(uint8_t* data)
{
    task();
    if (rx_flag) // has data
    {
        if (data != NULL) {
            // copy to user buffer if available
            memcpy(data, rx_buffer, E32RCRAD_PAYLOAD_SIZE);
        }
        rx_flag = false; // mark as read
        return E32RCRAD_PAYLOAD_SIZE; // report success
    }
    return -1; // report no data
}

int Esp32RcRadio::textAvail(void)
{
    task();
    return txt_flag ? E32RCRAD_PAYLOAD_SIZE : 0;
}

int Esp32RcRadio::textRead(char* buf)
{
    task();
    if (txt_flag) // has data
    {
        if (buf != NULL) {
            // copy to user buffer if available
            strncpy((char*)buf, (const char*)txt_rx_buffer, E32RCRAD_PAYLOAD_SIZE - 2);
        }
        txt_flag = false; // mark as read
        return E32RCRAD_PAYLOAD_SIZE; // report success
    }
    return -1; // report no data
}

void Esp32RcRadio::textSend(char* buf)
{
    strncpy((char*)txt_tx_buffer, (const char*)buf, E32RCRAD_PAYLOAD_SIZE - 2);
    _text_send_timer = _hop_tbl_len * E32RCRAD_TX_RETRANS_TXT; // makes sure the text is sent over all the channels a few times
    _seq_num++; // make sure the text is considered fresh
    if (_seq_num == 0) {
        // roll-over occured, start new session
        _session_id = esp_random();
        _seq_num++;
    }
}
